In [1]:
# asked in OneOrigin Interview (july/23)

In [33]:
import pandas as pd

In [34]:
data = [['Sahil', 25, False], ['Monis', 24, True]]

In [35]:
df = pd.DataFrame(data, columns = ['Name', 'Age', 'Campus_placement'])

In [36]:
df

    Name  Age  Campus_placement
0  Sahil   25             False
1  Monis   24              True

# Method - 1 | turn the new row into a dataframe then concat

In [37]:
new_row = ['Kamran', 24, False]

In [38]:
df2 = pd.DataFrame([new_row], columns = df.columns.to_list())
df2

     Name  Age  Campus_placement
0  Kamran   24             False

In [39]:
df = pd.concat([df, df2], ignore_index = True)

In [40]:
df

     Name  Age  Campus_placement
0   Sahil   25             False
1   Monis   24              True
2  Kamran   24             False

# Method - 2 | GFG says use append but after pandas 2.0, 
# append is depriciated

# Method - 3 | Use loc (don't use iloc because iloc cannot expand the dataframe)

In [41]:
new_row3 = ['Waris', 24, False]

In [42]:
df.iloc[len(df)] = [new_row3]

IndexError: iloc cannot enlarge its target object

In [43]:
df.loc[len(df)] = new_row3

In [44]:
df

     Name  Age  Campus_placement
0   Sahil   25             False
1   Monis   24              True
2  Kamran   24             False
3   Waris   24             False

# Add a new column and fill values

In [46]:
df

     Name  Age  Campus_placement
0   Sahil   25             False
1   Monis   24              True
2  Kamran   24             False
3   Waris   24             False

In [49]:
df['off_campus'] = [False, False, True, False]

In [50]:
df

     Name  Age  Campus_placement  off_campus
0   Sahil   25             False       False
1   Monis   24              True       False
2  Kamran   24             False        True
3   Waris   24             False       False